#ifndef __TABLE_AGING_H
#define __TABLE_AGING_H

#include "pub_header.h"

/**************************************************************************************************
                                        枚举定义
**************************************************************************************************/

/*计时器操作处理*/
typedef enum
{
    TIMER_REPLACE,                  /* 设置新的值 */
    TIMER_REDUCE,                   /* 减操作 */
}timer_opera_t;


/**************************************************************************************************
                                        函数声明
**************************************************************************************************/
uint32_t MONO_TIME(void);
void aging_scan_timer_init(void);
uint16_t session_mng_cell_set_timer(void *cell, timer_opera_t opera, uint16_t value);

/**************************************************************************************************
                                        全局变量声明
**************************************************************************************************/
extern uint32_t update_time;
extern uint32_t check_interval;
extern uint16_t g_aging_timer_max;

#endif
